jmeter/swagger-petstore-test-plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="swagger-petstore-test-plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="TARGET_HOST" elementType="Argument">
            <stringProp name="Argument.name">TARGET_HOST</stringProp>
            <stringProp name="Argument.value">10.87.1.236</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="TARGET_PORT" elementType="Argument">
            <stringProp name="Argument.name">TARGET_PORT</stringProp>
            <stringProp name="Argument.value">30010</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">AppD_Header</stringProp>
            <stringProp name="Header.value">${__samplerName}</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">AppD_ThreadName</stringProp>
            <stringProp name="Header.value">${__BeanShell(ctx.getThread().getThreadName())}</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">10.87.1.236</stringProp>
        <stringProp name="HTTPSampler.port">30010</stringProp>
        <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true">
        <collectionProp name="CookieManager.cookies"/>
        <boolProp name="CookieManager.clearEachIteration">false</boolProp>
        <boolProp name="CookieManager.controlledByThreadGroup">false</boolProp>
      </CookieManager>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="setUp Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </SetupThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="AppDynamics - Start Time - JSR223 Sampler" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">log.info(&quot;setUp Thread Group - AppDynamics&quot;);

// Calculate epoch time in seconds of starting test
var startTest = Math.floor(Date.now() - 1 * 60 * 1000);

// Set the epoch time in a property
props.setProperty(&quot;AppD_Start_Time&quot;, startTest);</stringProp>
          <stringProp name="scriptLanguage">javascript</stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group A" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <TestFragmentController guiclass="TestFragmentControllerGui" testclass="TestFragmentController" testname="Scenario 1 - Pet" enabled="true"/>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Pet_Create_New" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;id&quot;: 5001,&#xd;
  &quot;name&quot;: &quot;Blacky&quot;,&#xd;
  &quot;category&quot;: {&#xd;
    &quot;id&quot;: 1,&#xd;
    &quot;name&quot;: &quot;Cats&quot;&#xd;
  },&#xd;
  &quot;photoUrls&quot;: [&#xd;
    &quot;string&quot;&#xd;
  ],&#xd;
  &quot;tags&quot;: [&#xd;
    {&#xd;
      &quot;id&quot;: 0,&#xd;
      &quot;name&quot;: &quot;string&quot;&#xd;
    }&#xd;
  ],&#xd;
  &quot;status&quot;: &quot;available&quot;&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v3/pet</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Pet_Get_By_ID" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="HTTPSampler.path">/api/v3/pet/5001</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Pet_Update" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;id&quot;: 5001,&#xd;
  &quot;name&quot;: &quot;Blacky Ducky&quot;,&#xd;
  &quot;category&quot;: {&#xd;
    &quot;id&quot;: 1,&#xd;
    &quot;name&quot;: &quot;Cats&quot;&#xd;
  },&#xd;
  &quot;photoUrls&quot;: [&#xd;
    &quot;string&quot;&#xd;
  ],&#xd;
  &quot;tags&quot;: [&#xd;
    {&#xd;
      &quot;id&quot;: 0,&#xd;
      &quot;name&quot;: &quot;string&quot;&#xd;
    }&#xd;
  ],&#xd;
  &quot;status&quot;: &quot;available&quot;&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">/api/v3/pet</stringProp>
            <stringProp name="HTTPSampler.method">PUT</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Pet_Find_By_Status" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
              <collectionProp name="Arguments.arguments">
                <elementProp name="status" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">available</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                  <boolProp name="HTTPArgument.use_equals">true</boolProp>
                  <stringProp name="Argument.name">status</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">/api/v3/pet/findByStatus</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
        </hashTree>
        <TestFragmentController guiclass="TestFragmentControllerGui" testclass="TestFragmentController" testname="Scenario 2 - Store" enabled="true"/>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Store_Create_New" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;id&quot;: 10,&#xd;
  &quot;petId&quot;: 5001,&#xd;
  &quot;quantity&quot;: 7,&#xd;
  &quot;shipDate&quot;: &quot;2021-12-16T06:59:46.530Z&quot;,&#xd;
  &quot;status&quot;: &quot;approved&quot;,&#xd;
  &quot;complete&quot;: true&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">/api/v3/store/order</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Store_Get_Inventory" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="HTTPSampler.path">/api/v3/store/inventory</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Store_Get_By_ID" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="HTTPSampler.path">/api/v3/store/order/10</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
        </hashTree>
        <TestFragmentController guiclass="TestFragmentControllerGui" testclass="TestFragmentController" testname="Scenario 3 - User" enabled="true"/>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="User_Create_New" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;id&quot;: 1001,&#xd;
  &quot;username&quot;: &quot;psidev&quot;,&#xd;
  &quot;firstName&quot;: &quot;John&quot;,&#xd;
  &quot;lastName&quot;: &quot;James&quot;,&#xd;
  &quot;email&quot;: &quot;john@email.com&quot;,&#xd;
  &quot;password&quot;: &quot;12345&quot;,&#xd;
  &quot;phone&quot;: &quot;12345&quot;,&#xd;
  &quot;userStatus&quot;: 1&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">/api/v3/user</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="User_Get_By_Name" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="HTTPSampler.path">/api/v3/user/psidev</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
        </hashTree>
      </hashTree>
      <PostThreadGroup guiclass="PostThreadGroupGui" testclass="PostThreadGroup" testname="tearDown Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </PostThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="AppDynamics - End Time - JSR223 Sampler" enabled="true">
          <stringProp name="scriptLanguage">javascript</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">log.info(&quot;tearDown AppDynamics&quot;);

// Calculate epoch time of ending test
var endTest = Math.floor( Date.now() );

// Set the epoch time in a property
props.setProperty(&quot;AppD_End_Time&quot;, endTest);</stringProp>
        </JSR223Sampler>
        <hashTree/>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="AppDynamics - Create Time Range - JSR223 Sampler" enabled="true">
          <stringProp name="scriptLanguage">java</stringProp>
          <stringProp name="parameters">${__TestPlanName}</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import java.io.*;
import java.net.*;
import java.nio.charsert.StandardCharsets;
import java.text.SimpleDateFormat;
import java.util.Date;

String appdController = &quot;https://ptpacket.saas.appdynamics.com&quot;;

// Base64 encoded value of username@accountname:password
String appdBase64Auth = &quot;cHRwYWNrZXRAcHRwYWNrZXQ6VHIxcGwzSWMz&quot;;

String appdEndTime = props.getProperty(&quot;AppD_End_Time&quot;);
System.out.println(&quot;AppDynamics - AppD_End_Time = &quot; + appdEndTime);

String appdStartTime = props.getProperty(&quot;AppD_Start_Time&quot;);
System.out.println(&quot;AppDynamics - AppD_Start_Time = &quot; + appdStartTime);

// Connect to AppDynamics Controller
StringBuilder result = new StringBuilder();
URL url = new URL(appdController + &quot;/controller/auth?action=login&quot;);
HttpURLConnection conn = (HttpURLConnection) url.openConnection();

conn.setRequestProperty(&quot;Authorization&quot;, &quot;Basic &quot; + appdBase64Auth);
conn.setRequestMethod(&quot;GET&quot;);

BufferedReader brLogin = new BufferedReader(new InputStreamReader(conn.getInputStream()));

// If we are correctly connected to AppDynamics Controller
if (conn.getResponseCode() == 200) {
	String headerName = null;
	String appdCookie = &quot;&quot;;
	String csrfToken = &quot;&quot;;

	for (int i = 1; (headerName = conn.getHeaderFieldKey(i)) != null; i++) {
		if (headerName.equals(&quot;Set-Cookie&quot;)) {
			appdCookie += conn.getHeaderField(i) + &quot;; &quot;;
			if (conn.getHeaderField(i).contains(&quot;X-CSRF-TOKEN&quot;)) {
				String csrfTokenStr = conn.getHeaderField(i);
				
				csrfToken = csrfTokenStr.substring(&quot;X-CSRF-TOKEN&quot;.length()+1, csrfTokenStr.indexOf(&quot;;&quot;));

				System.out.println(&quot;X-CSRF-TOKEN=&quot; + csrfToken);
			}
		}		
	}
	System.out.println(&quot;appdCookie = &quot; + appdCookie);

	URL urlCustomRange = new URL(appdController + &quot;/controller/restui/user/createCustomRange&quot;);

	HttpURLConnection connCustomRange = (HttpURLConnection) urlCustomRange.openConnection();
	connCustomRange.setRequestMethod(&quot;POST&quot;);
	connCustomRange.setDoOutput(true);
	connCustomRange.setRequestProperty(&quot;Authorization&quot;, &quot;Basic &quot; + appdBase64Auth);
	connCustomRange.setRequestProperty(&quot;Content-Type&quot;, &quot;application/json&quot;);
	connCustomRange.setRequestProperty(&quot;charset&quot;, &quot;utf-8&quot;);
	connCustomRange.setRequestProperty(&quot;Accept-Encoding&quot;, &quot;gzip, deflate&quot;);
	connCustomRange.setRequestProperty(&quot;Accept&quot;, &quot;application/json, text/plain&quot;);
	connCustomRange.setRequestProperty(&quot;Cookie&quot;, appdCookie);
	connCustomRange.setRequestProperty(&quot;X-CSRF-TOKEN&quot;, csrfToken);

	// If the Test Plan name has been correctly in Parameters of this script
	if (args.length &gt; 0) {
		String appdTestPlan = args[0];
		// Remove the extension .jmx from file name
		if (appdTestPlan.indexOf(&quot;.jmx&quot;) != -1) {
			appdTestPlan = appdTestPlan.substring(0, appdTestPlan.indexOf(&quot;.jmx&quot;));
		}

		Date date = new Date();
		SimpleDateFormat sdf = new SimpleDateFormat(&quot;MMM dd HH:mm&quot;);
		appdTestPlan += &quot; &quot; + sdf.format(date);

		String postJsonData = &quot;{\&quot;name\&quot;:\&quot;&quot; + appdTestPlan + &quot;\&quot;,\&quot;description\&quot;:\&quot;JMeter execution\&quot;,\&quot;shared\&quot;:true,\&quot;timeRange\&quot;:{\&quot;type\&quot;:\&quot;BETWEEN_TIMES\&quot;,\&quot;durationInMinutes\&quot;:0,\&quot;startTime\&quot;:&quot; + appdStartTime + &quot;,\&quot;endTime\&quot;:&quot; + appdEndTime + &quot;}}&quot;;

		DataOutputStream wr = new DataOutputStream(connCustomRange.getOutputStream());
		wr.writeBytes(postJsonData);
		wr.flush();
		wr.close();

		if (connCustomRange.getResponseCode() != 200) {
			System.out.println(&quot;AppDynamics - Unable to create time range - &quot; + urlCustomRange + &quot; - &quot; + connCustomRange.getResponseCode() + &quot; - &quot; + postJsonData);
		}
	} else {
		System.out.println(&quot;AppDynamics - the test plan name has not been setup in parameters&quot;);
	}
} else {
	System.out.println(&quot;AppDynamics - Unable to connect to Controller - &quot; + url + &quot; - HTTP Code: &quot; + conn.getResponseCode());
}

brLogin.close();

</stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>